#Задание 1
a = int(input("Введите первое число"))
b = int(input("Введите второе число"))
if a! = b:
    if a > b:
        print ("1 максимальное число, 2 минимальное число")
    else:
        print ("1 максимальное число, 2 минимальное число")

#Задача 2
a = int(input("длинна стороны квадрата"))
b = int(input("радиус"))
if b <= a / 2:
    print("впишется круг")
else:
    print("круг не впишется")

#Задание 3
a = int(input("введите а"))
b = a**2
if b < 0:
    print("значение b меньше 0")
else:
    print("значение b не меньше 0")
    
#Задача 4
a = int(input("сторона квадрата"))
b = int(input("радиус круга"))
if a <= 2* b:
    print("квадрат впишется")
else:
    print("квадрат не впишется")
    
#Задача 5
a = int(input("Введите первое число"))
b = int(input("Введите второе число"))
if a > b:
    print (a)
else:
    print (b)
